Revit 2027 API
RebarShapeMultiplanarDefinition Constructor
 Create a RebarShapeMultiplanarDefinition for use in creating a RebarShape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeMultiplanarDefinition(
	double outOfPlaneBendDiameter
)
Public Sub New (
	outOfPlaneBendDiameter As Double
)
public:
RebarShapeMultiplanarDefinition(
	double outOfPlaneBendDiameter
)
new :
        outOfPlaneBendDiameter : float -> RebarShapeMultiplanarDefinition
Parameters
outOfPlaneBendDiameter Double
 Bend diameter to be used when the rebar bends out of its main plane.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for outOfPlaneBendDiameter must be greater than 0 and no more than 30000 feet.
See Also
Reference
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace